Tester/src/Catalogs/Sessions/Sessions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Sessions</name>
  <attributes>
    <name>Computer</name>
    <type>
      <types>CatalogRef.Computers</types>
    </type>
  </attributes>
  <attributes>
    <name>Localhost</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Port</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Proxy</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Version</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Tester/src/Catalogs/Sessions/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	setIP ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure setIP ()
	
	IP = Object.Localhost;
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	init ();
	AppearanceSrv.Read ( ThisObject );
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure init ()
	
	MySession = SessionParameters.Session = Object.Ref;
	
EndProcedure

&AtClient
Procedure AfterWrite ( WriteParameters )
	
	if ( MySession ) then
		Test.ShutdownProxy ();
	endif;
	
EndProcedure

&AtClient
Procedure BeforeWrite ( Cancel, WriteParameters )
	
	setLocalhost ();
	
EndProcedure

&AtClient
Procedure setLocalhost ()
	
	Object.Localhost = StrReplace ( IP, " ", "" );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure ProxyOnChange ( Item )
	
	applyProxy ();
	
EndProcedure

&AtClient
Procedure applyProxy ()
	
	if ( Object.Proxy ) then
		Object.Port = 1500;
		IP = "127.0.0.1";
	else
		Object.Port = 0;
		Object.Localhost = "";
		IP = "";
	endif;
	Appearance.Apply ( ThisObject, "Object.Proxy" );
	
EndProcedure
